#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle shared/.config/emacs/init.el

*** Treesitter
#+begin_src emacs-lisp
    (setq treesit-language-source-alist
          '((heex       "https://github.com/phoenixframework/tree-sitter-heex")
            (elixir     "https://github.com/elixir-lang/tree-sitter-elixir")
            (dockerfile "https://github.com/camdencheek/tree-sitter-dockerfile")
            (tsx        "https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src")
            (typescript "https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src")
            (javascript "https://github.com/tree-sitter/tree-sitter-javascript" "master" "src")
            (json       "https://github.com/tree-sitter/tree-sitter-json")
            (css        "https://github.com/tree-sitter/tree-sitter-css")
            (elisp      "https://github.com/Wilfred/tree-sitter-elisp")
            (go         "https://github.com/tree-sitter/tree-sitter-go")
            (gomod      "https://github.com/camdencheek/tree-sitter-go-mod")
            (python     "https://github.com/tree-sitter/tree-sitter-python")
            (toml       "https://github.com/tree-sitter/tree-sitter-toml")
            (bash       "https://github.com/tree-sitter/tree-sitter-bash")
            (markdown   "https://github.com/ikatyang/tree-sitter-markdown")
            (java       "https://github.com/tree-sitter/tree-sitter-java")
            (yaml       "https://github.com/ikatyang/tree-sitter-yaml")))

    (setq major-mode-remap-alist
          '((elixir-mode . elixir-ts-mode)
            (rust-mode . rust-ts-mode)
            (js-mode . js-ts-mode)
            (js-json-mode . json-ts-mode)
            (go-mode . go-ts-mode)
            (python-mode . python-ts-mode)
            (java-mode . java-ts-mode)))
#+end_src

#+RESULTS:
: ((elixir-mode . elixir-ts-mode) (rust-mode . rust-ts-mode) (js-mode . js-ts-mode) (js-json-mode . json-ts-mode) (go-mode . go-ts-mode) (python-mode . python-ts-mode))

